In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns, sklearn

In [2]:
df = pd.read_csv(r"C:\Users\HP PC\Downloads\groupbyExcercise - groupbyExcercise.csv")

In [3]:
df

    Unnamed: 0        Date Product  Revenue  Quantity
0            0  2023-01-01       A      221         3
1            1  2023-01-01       B      111         8
2            2  2023-01-02       B      171        11
3            3  2023-01-02       A      141        15
4            4  2023-02-01       A       75         4
5            5  2023-02-01       B       90        12
6            6  2023-02-02       A       96        17
7            7  2023-02-02       B      170        10
8            8  2023-03-01       B      200        19
9            9  2023-03-01       A      120        10
10          10  2023-03-02       A      121        12
11          11  2023-03-02       B      150         5

#### why we get unnamed: 0 when we download the any .csv file ?
* when the first column of the CSV file has rows but no header.
* You can also use the .drop() method to remove one or more rows or columns from a DataFrame. This returns a new DataFrame with the specified rows or columns removed.

In [4]:
df.drop('Unnamed: 0',inplace = True, axis = 1 )

In [5]:
df

          Date Product  Revenue  Quantity
0   2023-01-01       A      221         3
1   2023-01-01       B      111         8
2   2023-01-02       B      171        11
3   2023-01-02       A      141        15
4   2023-02-01       A       75         4
5   2023-02-01       B       90        12
6   2023-02-02       A       96        17
7   2023-02-02       B      170        10
8   2023-03-01       B      200        19
9   2023-03-01       A      120        10
10  2023-03-02       A      121        12
11  2023-03-02       B      150         5

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      12 non-null     object
 1   Product   12 non-null     object
 2   Revenue   12 non-null     int64
 3   Quantity  12 non-null     int64
dtypes: int64(2), object(2)
memory usage: 512.0+ bytes

In [7]:
df.columns

Index(['Date', 'Product', 'Revenue', 'Quantity'], dtype='object')

#### 1). Arrange DataFrame df, focusing on distinct product categories. Explore the data to reveal:
#### (i). Overall revenue insights

In [8]:
rp = df.groupby('Product')['Revenue'].sum()

In [9]:
rp

Product
A    774
B    892
Name: Revenue, dtype: int64

#### (ii). Average revenue patterns

In [10]:
rpd = df.groupby(['Product'])['Revenue'].mean()

In [11]:
rpd

Product
A    129.000000
B    148.666667
Name: Revenue, dtype: float64

#### (iii). Peak quantity sold observations

In [12]:
pqs = df.groupby(['Product'])['Quantity'].max()

In [13]:
pqs

Product
A    17
B    19
Name: Quantity, dtype: int64

#### (iv). Minimum quantity sold occurrences

In [14]:
mqs = df.groupby(['Product'])['Quantity'].min()

In [15]:
mqs

Product
A    3
B    5
Name: Quantity, dtype: int64

#### 2). Aggregate DataFrame df by extracting the month and year from the 'Date' column. Calculate the collective revenue for each unique combination of month and year.

In [16]:
df['Date'] = pd.to_datetime(df['Date'])

In [17]:
df

         Date Product  Revenue  Quantity
0  2023-01-01       A      221         3
1  2023-01-01       B      111         8
2  2023-01-02       B      171        11
3  2023-01-02       A      141        15
4  2023-02-01       A       75         4
5  2023-02-01       B       90        12
6  2023-02-02       A       96        17
7  2023-02-02       B      170        10
8  2023-03-01       B      200        19
9  2023-03-01       A      120        10
10 2023-03-02       A      121        12
11 2023-03-02       B      150         5

In [18]:
df['Month'] = df['Date'].dt.month

In [19]:
df

         Date Product  Revenue  Quantity  Month
0  2023-01-01       A      221         3      1
1  2023-01-01       B      111         8      1
2  2023-01-02       B      171        11      1
3  2023-01-02       A      141        15      1
4  2023-02-01       A       75         4      2
5  2023-02-01       B       90        12      2
6  2023-02-02       A       96        17      2
7  2023-02-02       B      170        10      2
8  2023-03-01       B      200        19      3
9  2023-03-01       A      120        10      3
10 2023-03-02       A      121        12      3
11 2023-03-02       B      150         5      3

In [20]:
df['Year'] = df['Date'].dt.year

In [21]:
df

         Date Product  Revenue  Quantity  Month  Year
0  2023-01-01       A      221         3      1  2023
1  2023-01-01       B      111         8      1  2023
2  2023-01-02       B      171        11      1  2023
3  2023-01-02       A      141        15      1  2023
4  2023-02-01       A       75         4      2  2023
5  2023-02-01       B       90        12      2  2023
6  2023-02-02       A       96        17      2  2023
7  2023-02-02       B      170        10      2  2023
8  2023-03-01       B      200        19      3  2023
9  2023-03-01       A      120        10      3  2023
10 2023-03-02       A      121        12      3  2023
11 2023-03-02       B      150         5      3  2023

In [22]:
agg = df.groupby(['Month', 'Year'])['Revenue'].sum()

In [23]:
agg

Month  Year
1      2023    644
2      2023    431
3      2023    591
Name: Revenue, dtype: int64

what if we use reset_index for the above statement :

In [24]:
agg = df.groupby(['Month', 'Year'])['Revenue'].sum().reset_index()

In [25]:
agg

   Month  Year  Revenue
0      1  2023      644
1      2  2023      431
2      3  2023      591

differences between them is : 
* agg = df.groupby(['Month', 'Year'])['Revenue'].sum() :
 Returns a Series with a MultiIndex made up of the grouped columns ('Month', 'Year').
* agg = df.groupby(['Month', 'Year'])['Revenue'].sum().reset_index(): 
Returns a DataFrame with 'Month' and 'Year' as regular index columns rather than a multiple level of indexing.

<b>the beat way is : reset_index() </b> 
* Easier to access groupby columns as df['Month'] instead of index
* Works better for joining/merging data
* Simpler to visualize groups rather than multi-index

#### 3). Group the DataFrame df by the 'Date' column and find the date with the highest total revenue and the date with the highest total quantity sold.

In [26]:
df['Date'] = pd.to_datetime(df['Date'])

In [27]:
gd = df.groupby('Date').agg({'Revenue':'sum','Quantity':'sum'}).reset_index()

In [28]:
gd

        Date  Revenue  Quantity
0 2023-01-01      332        11
1 2023-01-02      312        26
2 2023-02-01      165        16
3 2023-02-02      266        27
4 2023-03-01      320        29
5 2023-03-02      271        17

In [29]:
hr = gd.loc[gd['Revenue'].idxmax(), 'Date']

In [30]:
print("Date with highest revenue:", hr)

Date with highest revenue: 2023-01-01 00:00:00

In [31]:
dh = gd.loc[gd['Quantity'].idxmax(), 'Date']

In [32]:
print("Date with highest quantity:", dh)

Date with highest quantity: 2023-03-01 00:00:00

#### idmax() :
* returns the index value of the maximum value in a Series or DataFrame column.
* Works on Series or DataFrame columns, returns the index label of the maximum value, useful to lookup the row containing max value.

* here we use .idxmax() returning the index label, using .loc[] is more appropriate here to retrieve the row for that label directly.

#### 4).  Group the DataFrame df by the Date and find products that have a total quantity sold greater than 10 and less than 15 .

In [33]:
gd = df.groupby(['Date', 'Product'])['Quantity'].sum().reset_index()

In [34]:
gd

         Date Product  Quantity
0  2023-01-01       A         3
1  2023-01-01       B         8
2  2023-01-02       A        15
3  2023-01-02       B        11
4  2023-02-01       A         4
5  2023-02-01       B        12
6  2023-02-02       A        17
7  2023-02-02       B        10
8  2023-03-01       A        10
9  2023-03-01       B        19
10 2023-03-02       A        12
11 2023-03-02       B         5

In [35]:
x = gd[(gd['Quantity'] > 10) & (gd['Quantity'] < 15)]

In [36]:
x

         Date Product  Quantity
3  2023-01-02       B        11
5  2023-02-01       B        12
10 2023-03-02       A        12

#### 5).  roup the DataFrame df by the 'Product' column and add a new column 'Revenue Percentage' that shows the percentage of each product's revenue relative to the total revenue for that product.

In [52]:
product = df.groupby('Product')['Revenue'].sum()

In [53]:
product

Product
A    774
B    892
Name: Revenue, dtype: int64

In [54]:
total = df['Revenue'].sum() # its a numpy function.

In [55]:
total

1666

In [57]:
percentage = (product/total)*100

In [59]:
df = df.join(percentage, on='Product', rsuffix='_pct')

In [61]:
df = df.rename(columns={percentage.name: 'Revenue Percentage'})

In [62]:
df

         Date Product  Revenue Percentage  Quantity  Month  Year  Revenue_pct
0  2023-01-01       A                 221         3      1  2023    46.458583
1  2023-01-01       B                 111         8      1  2023    53.541417
2  2023-01-02       B                 171        11      1  2023    53.541417
3  2023-01-02       A                 141        15      1  2023    46.458583
4  2023-02-01       A                  75         4      2  2023    46.458583
5  2023-02-01       B                  90        12      2  2023    53.541417
6  2023-02-02       A                  96        17      2  2023    46.458583
7  2023-02-02       B                 170        10      2  2023    53.541417
8  2023-03-01       B                 200        19      3  2023    53.541417
9  2023-03-01       A                 120        10      3  2023    46.458583
10 2023-03-02       A                 121        12      3  2023    46.458583
11 2023-03-02       B                 150         5      3  2023    53.541417

* .join() method in pandas allows you to join/merge additional columns from another DataFrame or Series onto your existing DataFrame.
* on='Product': Column to join dataframes on
* rsuffix='_pct': Adds suffix to overlapping columns